React_Module_Scripts/Substitute_React_Substitute_Module/React_Substitute_Reports_api.yml
execution:
#- executor: jmeter
- concurrency: 100
  ramp-up: 100s
  hold-for: 50m
  scenario: Substitute_React_Substitute

scenarios:
  Substitute_React_Substitute:
    script: Substitute_React_Substitute.jmx

modules:
  console:
    disable: true # disable runtime console reporter

reporting:
#- module: console
- module: passfail
  criteria:
  - avg-rt>10s for 30s, stop as failed
  - fail>50% for 20s, stop as failed